# Exercise 2

## Connect Database

In [65]:
%load_ext sql 

%config SqlMagic.displaylimit = 5

%reload_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql postgresql://postgres:12345@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [4]:
# set search path
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

### 1.Find all customers with customer number, name, city and state from the USA.

In [10]:
%%sql

select customernumber , customername ,city , state 
from customers where country='USA';

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

36 rows affected.

+----------------+------------------------------+---------------+-------+
| customernumber |         customername         |      city     | state |
+----------------+------------------------------+---------------+-------+
|      112       |      Signal Gift Stores      |   Las Vegas   |   NV  |
|      124       | Mini Gifts Distributors Ltd. |   San Rafael  |   CA  |
|      129       |       Mini Wheels Co.        | San Francisco |   CA  |
|      131       |      Land of Toys Inc.       |      NYC      |   NY  |
|      151       |      Muscle Machine Inc      |      NYC      |   NY  |
+----------------+------------------------------+---------------+-------+
Truncated to displaylimit of 5.

### 2.Display customer names along with their order numbers and order dates where order date betwen 2003-05-01 and 2004-05-01

In [15]:
%%sql

select customernumber, ordernumber , orderdate 
from orders
join customers using (customernumber)
where orderdate Between '2003-05-01' and '2004-05-01';

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

127 rows affected.

+----------------+-------------+---------------------+
| customernumber | ordernumber |      orderdate      |
+----------------+-------------+---------------------+
|      353       |    10121    | 2003-05-07 00:00:00 |
|      350       |    10122    | 2003-05-08 00:00:00 |
|      103       |    10123    | 2003-05-20 00:00:00 |
|      112       |    10124    | 2003-05-21 00:00:00 |
|      114       |    10125    | 2003-05-21 00:00:00 |
+----------------+-------------+---------------------+
Truncated to displaylimit of 5.

### 3.Find all orders that have been shipped, showing the customer name, order number, and shipped date.

In [16]:
%%sql

select customername , ordernumber ,shippeddate
from orders
join customers using (customernumber)
where status = 'Shipped';

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

303 rows affected.

+------------------------------+-------------+---------------------+
|         customername         | ordernumber |     shippeddate     |
+------------------------------+-------------+---------------------+
| Online Diecast Creations Co. |    10100    | 2003-01-10 00:00:00 |
|     Blauer See Auto, Co.     |    10101    | 2003-01-11 00:00:00 |
|       Vitachrome Inc.        |    10102    | 2003-01-14 00:00:00 |
|      Baane Mini Imports      |    10103    | 2003-02-02 00:00:00 |
|    Euro+ Shopping Channel    |    10104    | 2003-02-01 00:00:00 |
+------------------------------+-------------+---------------------+
Truncated to displaylimit of 5.

### 4.Show order details including customer name, order number, product name, quantity ordered, and price where quantityOrdered > 40

In [29]:
%%sql

select customername,  ordernumber , productname , quantityordered ,	priceeach
from orderdetails
join orders using (ordernumber)
join customers using (customernumber)
join products using (productcode)
where quantityordered > 40;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

979 rows affected.

+------------------------------+-------------+-------------------------------------------+-----------------+-----------+
|         customername         | ordernumber |                productname                | quantityordered | priceeach |
+------------------------------+-------------+-------------------------------------------+-----------------+-----------+
| Online Diecast Creations Co. |    10100    |             1911 Ford Town Car            |        50       |   55.09   |
| Online Diecast Creations Co. |    10100    |      1936 Mercedes Benz 500k Roadster     |        49       |   35.29   |
|     Blauer See Auto, Co.     |    10101    |        1939 Chevrolet Deluxe Coupe        |        45       |   32.53   |
|     Blauer See Auto, Co.     |    10101    | 1938 Cadillac V-16 Presidential Limousine |        46       |   44.35   |
|       Vitachrome Inc.        |    10102    |  1936 Mercedes-Benz 500K Special Roadster |        41       |   43.13   |
+------------------------------+-------------+-------------------------------------------+-----------------+-----------+
Truncated to displaylimit of 5.

### 5.Create a report showing employees and the orders they've processed through their customers only year 2004 and order status is 'Shipped' or 'Resolved'

In [25]:
%%sql

select * from orders;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

326 rows affected.

+-------------+---------------------+---------------------+---------------------+---------+------------------------+----------------+
| ordernumber |      orderdate      |     requireddate    |     shippeddate     |  status |        comments        | customernumber |
+-------------+---------------------+---------------------+---------------------+---------+------------------------+----------------+
|    10100    | 2003-01-06 00:00:00 | 2003-01-13 00:00:00 | 2003-01-10 00:00:00 | Shipped |          None          |      363       |
|    10101    | 2003-01-09 00:00:00 | 2003-01-18 00:00:00 | 2003-01-11 00:00:00 | Shipped | Check on availability. |      128       |
|    10102    | 2003-01-10 00:00:00 | 2003-01-18 00:00:00 | 2003-01-14 00:00:00 | Shipped |          None          |      181       |
|    10103    | 2003-01-29 00:00:00 | 2003-02-07 00:00:00 | 2003-02-02 00:00:00 | Shipped |          None          |      121       |
|    10104    | 2003-01-31 00:00:00 | 2003-02-09 00:00:00 | 2003-02-01 00:00:00 | Shipped |          None          |      141       |
+-------------+---------------------+---------------------+---------------------+---------+------------------------+----------------+
Truncated to displaylimit of 5.

In [26]:
%%sql

select * from employees;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

23 rows affected.

+----------------+-----------+-----------+-----------+---------------------------------+-----------+----------------------+------------+
| employeenumber |  lastname | firstname | extension |              email              | reportsto |       jobtitle       | officecode |
+----------------+-----------+-----------+-----------+---------------------------------+-----------+----------------------+------------+
|      1002      |   Murphy  |   Diane   |   x5800   |   dmurphy@classicmodelcars.com  |    None   |      President       |     1      |
|      1056      | Patterson |    Mary   |   x4611   |  mpatterso@classicmodelcars.com |    1002   |       VP Sales       |     1      |
|      1076      |  Firrelli |    Jeff   |   x9273   |  jfirrelli@classicmodelcars.com |    1002   |     VP Marketing     |     1      |
|      1088      | Patterson |  William  |   x4871   | wpatterson@classicmodelcars.com |    1056   | Sales Manager (APAC) |     6      |
|      1102      |   Bondur  |   Gerard  |   x5408   |   gbondur@classicmodelcars.com  |    1056   | Sale Manager (EMEA)  |     4      |
+----------------+-----------+-----------+-----------+---------------------------------+-----------+----------------------+------------+
Truncated to displaylimit of 5.

In [27]:
%%sql

select * from customers;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

122 rows affected.

+----------------+----------------------------+-----------------+------------------+--------------+------------------------------+--------------+-----------+----------+------------+-----------+------------------------+-------------+----------------------------------------------------+
| customernumber |        customername        | contactlastname | contactfirstname |    phone     |         addressline1         | addressline2 |    city   |  state   | postalcode |  country  | salesrepemployeenumber | creditlimit |                  customerlocation                  |
+----------------+----------------------------+-----------------+------------------+--------------+------------------------------+--------------+-----------+----------+------------+-----------+------------------------+-------------+----------------------------------------------------+
|      103       |     Atelier graphique      |     Schmitt     |     Carine       |  40.32.2555  |        54, rue Royale        |     None     |   Nantes  |   None   |   44000    |   France  |          1370          |    21000    | 0101000020E61000006D31E47DC19B47405DA5BBEB6CE8F8BF |
|      112       |     Signal Gift Stores     |       King      |       Jean       |  7025551838  |       8489 Strong St.        |     None     | Las Vegas |    NV    |   83030    |    USA    |          1166          |    71800    | 0101000020E6100000014F5AB8AC0E42406F0ED76A0FCB5CC0 |
|      114       | Australian Collectors, Co. |     Ferguson    |      Peter       | 03 9520 4555 |      636 St Kilda Road       |   Level 3    | Melbourne | Victoria |    3004    | Australia |          1611          |    117300   | 0101000020E61000008F84228216E842C0E31698BAD01E6240 |
|      119       |     La Rochelle Gifts      |     Labrune     |     Janine       |  40.67.8555  | 67, rue des Cinquante Otages |     None     |   Nantes  |   None   |   44000    |   France  |          1370          |    118200   | 0101000020E61000006D31E47DC19B47405DA5BBEB6CE8F8BF |
|      121       |     Baane Mini Imports     |    Bergulfsen   |      Jonas       |  07-98 9555  |    Erling Skakkes gate 78    |     None     |  Stavern  |   None   |    4110    |   Norway  |          1504          |    81700    | 0101000020E6100000644227DFC77F4D4012D4957439122440 |
+----------------+----------------------------+-----------------+------------------+--------------+------------------------------+--------------+-----------+----------+------------+-----------+------------------------+-------------+----------------------------------------------------+
Truncated to displaylimit of 5.

In [50]:
%%sql

select e.employeeNumber, c.customernumber, o.ordernumber , o.orderdate , o.status
from orders as o
join customers as c on o.customerNumber = c.customernumber
join employees as e on e.employeenumber = c.salesrepemployeenumber
where (status = 'Shipped' or  status = 'Resolved') 
    AND (o.orderdate between '2004-01-01' and '2004-12-31');

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

146 rows affected.

+----------------+----------------+-------------+---------------------+---------+
| employeenumber | customernumber | ordernumber |      orderdate      |  status |
+----------------+----------------+-------------+---------------------+---------+
|      1337      |      146       |    10208    | 2004-01-02 00:00:00 | Shipped |
|      1166      |      347       |    10209    | 2004-01-09 00:00:00 | Shipped |
|      1621      |      177       |    10210    | 2004-01-12 00:00:00 | Shipped |
|      1337      |      406       |    10211    | 2004-01-15 00:00:00 | Shipped |
|      1370      |      141       |    10212    | 2004-01-16 00:00:00 | Shipped |
+----------------+----------------+-------------+---------------------+---------+
Truncated to displaylimit of 5.